Revit 2027 API
DirectShapeLibrary.ContainsType Method
 A quick check whether a definition type already exists in the library. Checks for type objects only.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ContainsType(
	string name
)
Public Function ContainsType (
	name As String
) As Boolean
public:
bool ContainsType(
	String^ name
)
member ContainsType :
        name : string -> bool
Parameters
name String
 Definition id
Return Value
Boolean
 True if a geometry definition exists, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeLibrary Class
Autodesk.Revit.DB Namespace